testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_10000000____delay-ms_0____loss-rate-percent_0____clients-requests_10/7/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 333.17ms, 30.02 req/s, 286.34MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 95.40MB (100031270) total, 120B (120) headers (space savings 87.37%), 95.37MB (100000000) data
UDP datagram: 4178 sent, 82163 received
                     min         max         mean         sd        +/- sd
time for request:   306.33ms    327.69ms    316.33ms      7.57ms    60.00%
time for connect:     4.14ms     25.38ms     14.62ms      7.15ms    60.00%
time to 1st byte:    25.10ms     27.83ms     26.42ms      1.05ms    70.00%
req/s           :       3.01        3.04        3.02        0.01    80.00%